tests/eikonal/porousSample/src/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         simpleFoam;

// startFrom           latestTime;

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             500;

deltaT              1;

writeControl        timeStep;

writeInterval       500;

purgeWrite          0;

writeForma          ascii;

writePrecision      10;

writeCompression    yes;

timeFormat          general;

timePrecision       8;

runTimeModifiable   yes;

adjustTimeStep      yes;

maxCo               0.5;
maxAlphaCo          0.2;

maxDeltaT           $writeInterval;

libs (
    "libOpenFOAM.so"
);

functions
{
    processorField1
    {
        type            processorField;

        libs            ("libfieldFunctionObjects.so");

        writeControl    writeTime;
    }

    #includeFunc    residuals
}

// ************************************************************************* //
