tests/eikonal/porousSample/src/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom       patch;
sourceCase          "$FOAM_CASE";

sourcePatches       (zPlane);
exposedPatchName    dzPlane;

// extrudeModel        linearNormal;
// extrudeModel        linearDirection;
extrudeModel        plane;
/*
linearNormal:    linear extrusion in point-normal direction
plane:           single-layer, point-normal extrusion with empty type (2D)
linearDirection: linear extrusion in specified direction
wedge:           single-layer, wedge extrusion with wedge type (axisymmetric)
sector:          sector extrusion about specified axis
linearRadial:    linear extrusion in radial direction
radial:          linear extrusion in radial direction with multiple radii
*/

thickness           0.05; // used by plane extrusion

nLayers             1;

expansionRatio      1.0;

// linearNormalCoeffs
// {
//     thickness       0.01;
// }

// linearDirectionCoeffs
// {
//     direction       (0 0 1);
//     thickness       0.05;
// }

flipNormals         true;
mergeFaces          false;
mergeTol            0;


// ************************************************************************* //
