tests/eikonal/porousSample/src/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    rockSkeletonWalls
    {
        type            noSlip;
    }

    zPlane
    {
        type            empty;
    }

    dzPlane
    {
        type            empty;
    }

    xPlane
    {
        type            zeroGradient;
//         type            pressureNormalInletOutletVelocity;
//         phi             phi;
//         rho             rho;
//         value           uniform (0 0 0);
    }

    dxPlane
    {
        type            zeroGradient;
//         type            pressureNormalInletOutletVelocity;
//         phi             phi;
//         rho             rho;
//         value           uniform (0 0 0);
    }

    yPlane
    {
        type            zeroGradient;
//         type            pressureNormalInletOutletVelocity;
//         phi             phi;
//         rho             rho;
//         value           uniform (0 0 0);
    }

    dyPlane
    {
        type            zeroGradient;
//         type            pressureNormalInletOutletVelocity;
//         phi             phi;
//         rho             rho;
//         value           uniform (0 0 0);
    }

    defaultFaces
    {
        type            noSlip;
    }
}


// ************************************************************************* //
