tests/eikonal/porousSample/src/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    rockSkeletonWalls
    {
        type            zeroGradient;
    }

    zPlane
    {
        type            empty;
    }

    dzPlane
    {
        type            empty;
    }

    xPlane
    {
        type            fixedValue;
        value           uniform 1;
//         type            totalPressure;
//         p0              uniform 1e-3;
    }

    dxPlane
    {
        type            fixedValue;
        value           uniform 0;
//         type            totalPressure;
//         p0              uniform 0;
    }

    yPlane
    {
        type            fixedValue;
        value           uniform 1;
//         type            totalPressure;
//         p0              uniform 1e-3;
    }

    dyPlane
    {
        type            fixedValue;
        value           uniform 0;
//         type            totalPressure;
//         p0              uniform 0;
    }

    defaultFaces
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
