tests/eikonal/porousSample/src/0/alpha.liquid1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      alpha.liquid1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    rockSkeletonWalls
    {
        type           constantAlphaContactAngle;
        theta0         135;
        limit          gradient;
        value          uniform 0;
    }

    zPlane
    {
        type            empty;
    }

    dzPlane
    {
        type            empty;
    }

    xPlane
    {
        type            inletOutlet;
        value           uniform 1;
        inletValue      uniform 1;
    }

    dxPlane
    {
        type            zeroGradient;
    }

    yPlane
    {
        type            inletOutlet;
        value           uniform 1;
        inletValue      uniform 1;
    }

    dyPlane
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type           constantAlphaContactAngle;
        theta0         135;
        limit          gradient;
        value          uniform 0;
    }
}


// ************************************************************************* //
