tests/eikonal/porousSample/src/system/distanceField
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes distance field from wall.

\*---------------------------------------------------------------------------*/

#includeEtc "distanceField.cfg"

fields  (<fieldNames>);

// ************************************************************************* //
