tests/eikonal/porousSample/src/system/distanceField.cfg
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            distanceField;
libs            ("libdistanceFieldFunctionObject.so");

writeControl    writeTime;
writeInterval   1;

writeFields     false;

regionType      all;

// ************************************************************************* //
