tests/eikonal/porousSample/src/system/snappyHexMeshSrc/eMeshList
{
    file "rockSkeletonWalls.eMesh";
    level 0;
}
