tests/eikonal/porousSample/src/system/snappyHexMeshSrc/locationInMesh
locationInMesh (5.5 0 0);
